#include <MonoWave\CalculationRules\Designations\Rule_6\rule_6_utils.mqh>



int Rule_6_a(){
////////////////////////////////////////////////////////////////////////////////////////////////////////////
//Условие “а”: дължината на m0 e по-малка от 100% от дължината на m1
////////////////////////////////////////////////////////////////////////////////////////////////////////////  
   if (WavesCountInDirection(2) > 3){
   //**(ако m2 се състои от повече от три моновълни [или група моновълни] )
      InfoParagraph = "6-a-i:1";
      Rule_6_a_i_paragraph_1();
      InfoParagraph = "6-a-i:2";
      Rule_6_a_i_paragraph_2();
   }else{
   //**(ако m2 се състои от не повече от три моновълни [или група моновълни] )
      InfoParagraph = "6-a-ii:1";
      Rule_6_a_ii_paragraph_1();
      InfoParagraph = "6-a-ii:2";
      Rule_6_a_ii_paragraph_2();
      InfoParagraph = "6-a-ii:3";
      Rule_6_a_ii_paragraph_3();
      InfoParagraph = "6-a-ii:4";
      Rule_6_a_ii_paragraph_4();
      InfoParagraph = "6-a-ii:5";
      Rule_6_a_ii_paragraph_5();
      InfoParagraph = "6-a-ii:All";
      Rule_6_all();
      
   }      
}

//----------------------------------------------------------------------------------------------------------
//**(ако m2 се състои от повече от три моновълни [или група моновълни] )
//----------------------------------------------------------------------------------------------------------

int Rule_6_a_i_paragraph_1(){
/* 
////////////////////////////////////////////////////////////////////////////////////////////////////////////
Ако дължината на първите три моновълни на m2 е не-повече от 61.8% от дължината на m1, 
то може да започва Сложна Корекция от първата или втората от тези моновълни (след m1), 
насочена противоположно на m1 и е х-вълна, ИЛИ m1 съдържа в центъра си пропаднала х-вълна, 
ИЛИ  m1 е трета вълна в Трендови или Терминален Импулс с неуспешна 5-та.; 
поставете в края на m1 обозначение “:5/:s5”. 
ЗАБЕЛЕЖКА: разглеждайки варианта “Пропаднала” х-вълна, 
поставете кръгче в центъра на m1 и отляво на него поставете обозначение “:5?”, а отдясно обозначение “:F3?”; 
завършването на Сложна Корекция ще получи подтвърждение в точка в която пазара рязко обръща посоката си  
(противоположно на m1) и дължината на m2 превишава 61.8% от дължината m1.

////////////////////////////////////////////////////////////////////////////////////////////////////////////
*/ 
   
   double ratio_p = CompareLengthWithCountWaves(1, 2, /*countwave*/3);
   if (Small_061(ratio_p)){
      AddDesignation(desig_5, "");
      AddDesignation(desig_s5, "");
      AddDesignation(desig_fall, "1");
   }
      
   return(0);
}

int Rule_6_a_i_paragraph_2(){
/* 
////////////////////////////////////////////////////////////////////////////////////////////////////////////
Ако дължината на първите три моновълни от m2 превишава 61.8% дължината на m1, 
то може да завършва или а-вълна на Плоска Корекция със сложна b-вълна, 
или трета вълна на Импулсна ценова фигура с неуспешна 5-та.; 
в края на m1 поставете обозначение “:F3/:5” описващо тези два алтернативни варианта.
////////////////////////////////////////////////////////////////////////////////////////////////////////////   
*/ 
   double ratio_p = CompareLengthWithCountWaves(1, 2, /*countwave*/3);
   if (Large_061(ratio_p)){
      AddDesignation(desig_F3, "");
      AddDesignation(desig_5, "");
   }
   
   return(0);
}


//----------------------------------------------------------------------------------------------------------
//**(ако m2 се състои от не повече от три моновълни [или група моновълни] )
//----------------------------------------------------------------------------------------------------------

int Rule_6_a_ii_paragraph_1(){
/* 
////////////////////////////////////////////////////////////////////////////////////////////////////////////
Ако дължината на m3 е по-малка от 61.8% от дължината на m2, поставете в края на m1 обозначение “:L5”. 
Ако дължините на вълна m(-2) и m0 се препокриват, добавете в Структорният списък обозначение “:L3”.
////////////////////////////////////////////////////////////////////////////////////////////////////////////
*/                  
   double ratio_p = ComparePriceDirection(3, 2);      
   if (Small_061(ratio_p)){         
      AddDesignation(desig_L5, "");   
      if (OverlapDirection(-2, 0)){
         AddDesignation(desig_L3, "");      
      }
   }


   return(0);   
} 

int Rule_6_a_ii_paragraph_2(){
/* 
////////////////////////////////////////////////////////////////////////////////////////////////////////////
Ако дължината на m3 е 61.8% или повече от дължината на m2, 
поставете в края на m1 обозначение “:L5”.
////////////////////////////////////////////////////////////////////////////////////////////////////////////
*/                  
   double ratio_p = ComparePriceDirection(3, 2);      
   if (Large_061(ratio_p)){         
      AddDesignation(desig_L5, "");   
   }


   return(0);   
} 

int Rule_6_a_ii_paragraph_3(){
/* 
////////////////////////////////////////////////////////////////////////////////////////////////////////////
Ако началното ниво на m1 (плюс една единица време) се достига за време не превишаващо времето за нейното формиране, 
то m1 може да завършва Трендови Импулс; поставете в края на m1 обозначение “:L5”.
////////////////////////////////////////////////////////////////////////////////////////////////////////////
*/    
   if (BreakBeginingLevel(1, /*(плюс една единица време)*/1)){    
      AddDesignation(desig_L5, "");      
   }          
   return(0);   
} 

int Rule_6_a_ii_paragraph_4(){
/* 
////////////////////////////////////////////////////////////////////////////////////////////////////////////
Ако началното ниво на m1 (плюс една единица време) се достига за време не превишаващо времето за нейното формиране, 
и m3 е по-кратка от m2, и m2 (или група вълни m2- m4) достигат или пресичат началното ниво на  m(-3) за време, 
не превишаващо 50% от продължителността на разстоянието от началото на m(-3) до края на m1, 
и дължините на m0 и m(-2) се застъпват, то m1 може да завършва Терминален Импулс; 
добавете в края на m1 обозначение “(:L3)”. 
Ако дължината на m3 е в границите от 61.8% до 100% от дължината на m2 (не се включват границите)  
и предпочитано се явява обзначение “:L3”, то m2, по всяка верояност, 
ще бъде х-вълна ИЛИ в вълна m1 завършва Терминален Импулс който ще влиза в състава на Триъгълник от по-висок порядък; 
поставете в края на m2 обозначение “х:с3?”.
////////////////////////////////////////////////////////////////////////////////////////////////////////////
*/    
   if (BreakBeginingLevel(1, /*(плюс една единица време)*/1)){    
   
      double ratio_p = ComparePriceDirection(3, 2);      
      if (Small_100(ratio_p, true)){         
      
         if (CheckTimeGoToBeginning(-3, DirectionSumTimeLength(-3, 1)*0.6,  1)){
            
            if (OverlapDirection(-2, 0)){
               AddDesignation(desig_L3, "()");                   
               
               ratio_p = ComparePriceDirection(3, 2); 
               if (Large_061(ratio_p)){ 
                  //м3 :-> между 61%-100% * м2
                  AddDesignation(desig_xc3_, "2"); 
               }               
            }            
         }                  
      }      
   }          
   return(0);   
} 

int Rule_6_a_ii_paragraph_5(){
/* 
////////////////////////////////////////////////////////////////////////////////////////////////////////////
Ако началното ниво на m1 се достига бавно (продължително), отколкото времето за формиране на m1, 
и вълна m2 не пресича крайното ниво на m(-2), и дължината на  m(-1) е НЕ по-малко от 61.8% от дължината на m1, 
и m(-2) е по-кратка от m(-1), то m1 може да бъде а-вълна на Плоска Корекция, завършваща Сложна Корекция, 
х-вълна която се явява m0; поставете обозначение “:F3” в края на m1 и обозначение “х:с3?” – в края на m0.
////////////////////////////////////////////////////////////////////////////////////////////////////////////
*/    
   if (!BreakBeginingLevel(1, 0)){    
      
      if (!Check_Direct2_Break_EndDirect_1(-2, 2)){
      
         double ratio_p = ComparePriceDirection(-1, 1);      
         if (Large_061(ratio_p)){                     
            
            ratio_p = ComparePriceDirection(-2, -1);      
            if (Small_100(ratio_p)){            
            
               AddDesignation(desig_F3, ""); 
               AddDesignation(desig_xc3_, "0"); 
            
            }              
         }
      }      
   }          
   return(0);   
} 



