#include <MonoWave\CalculationRules\Designations\Rule_7\rule_7_utils.mqh>



int Rule_7_a(){
////////////////////////////////////////////////////////////////////////////////////////////////////////////
//Условие “а”: дължината на m0 по-малка от 100% от дължината m1
////////////////////////////////////////////////////////////////////////////////////////////////////////////  
   if (WavesCountInDirection(2) > 3){
   //**(ако m2 се състои от повече от три моновълни [или група моновълни] )
      InfoParagraph = "7-a-i:1";
      Rule_7_a_i_paragraph_1();
      InfoParagraph = "7-a-i:2";
      Rule_7_a_i_paragraph_2();
   }else{
   //**(ако m2 се състои от не повече от три моновълни [или група моновълни] )
      InfoParagraph = "7-a-ii:1";
      Rule_7_a_ii_paragraph_1();
      InfoParagraph = "7-a-ii:2";
      Rule_7_a_ii_paragraph_2();
      InfoParagraph = "7-a-ii:All";
      Rule_7_all();
      
   }      
}

//----------------------------------------------------------------------------------------------------------
//**(ако m2 се състои от повече от три моновълни [или група моновълни] )
//----------------------------------------------------------------------------------------------------------

int Rule_7_a_i_paragraph_1(){
/* 
////////////////////////////////////////////////////////////////////////////////////////////////////////////
Ако дължината на трите първи моновълни на m2 е не по-голяма от 61.8% от дължината на m1, 
то може да започава Сложна корекция от първата или втората от тези моновълни (след m1), 
насочена противоположно на m1 и представляваща х-вълна, ИЛИ m1 съдържа в центъра си пропаднала х-вълна, 
ИЛИ m1 е трета вълна на Трендови или Терминален импулс с неуспешна пета; 
поставете в края на m1 обозначение “:5/:s5”, а в края на m2 обозачение “х:с3?”. 
ЗАБЕЛЕЖКА: при разглеждане варианта с пропаднала х-вълна, поставете кръгче в центъра на m1 и отляво напишете “:5?”, 
а отдясно – поставете обозначение “:F3?”; завършването на Сложната Корекция се подтвърждава, 
когато пазара рязко объща (противоположно на m1), а дължината на m2 превиши 61.8% дължината на m1. 

////////////////////////////////////////////////////////////////////////////////////////////////////////////
*/ 
   
   double ratio_p = CompareLengthWithCountWaves(1, 2, /*countwave*/3);
   if (Small_061(ratio_p)){
      AddDesignation(desig_5, "");
      AddDesignation(desig_s5, "");
      AddDesignation(desig_xc3_, "2");
      AddDesignation(desig_fall, "1");
   }
      
   return(0);
}

int Rule_7_a_i_paragraph_2(){
/* 
////////////////////////////////////////////////////////////////////////////////////////////////////////////
Ако дължината на първите три моновълни на m2 превишава 61.8% от дължината на m1, 
то m1 може да бъде а-вълна на Плоска Корекция със сложна b-вълна 
ИЛИ трета вълна на Импулсна ценова фигура с неуспешна Пета; 
поставете в края на m1 обозначение “:F3/:5”.
////////////////////////////////////////////////////////////////////////////////////////////////////////////   
*/ 
   double ratio_p = CompareLengthWithCountWaves(1, 2, /*countwave*/3);
   if (Large_061(ratio_p)){
      AddDesignation(desig_F3, "");
      AddDesignation(desig_5, "");
   }
   
   return(0);
}


//----------------------------------------------------------------------------------------------------------
//**(ако m2 се състои от не повече от три моновълни [или група моновълни] )
//----------------------------------------------------------------------------------------------------------

int Rule_7_a_ii_paragraph_1(){
/* 
////////////////////////////////////////////////////////////////////////////////////////////////////////////
Независимо от съседните фигури, в тази ситуация висока е вероятността m1 да се описва с обозначението “:L5”. 
Поставете това обозначение в края на m1.
////////////////////////////////////////////////////////////////////////////////////////////////////////////
*/                  
   AddDesignation(desig_L5, "");   
   return(0);   
} 

int Rule_7_a_ii_paragraph_2(){
/* 
////////////////////////////////////////////////////////////////////////////////////////////////////////////
Ако дължината на m3 е по-малка от 61.8% от дължината на m2, и вълна m(-2) е по-кратка от m(-1), 
и дължините на вълни m(-2) и m0 се застъпват, то m1 може да завъшва Терминален Импулс; 
добавете в списъка на m1 обозначение “(:L3)”.
////////////////////////////////////////////////////////////////////////////////////////////////////////////
*/                  
   double ratio_p = ComparePriceDirection(3, 2);      
   if (Small_061(ratio_p)){  
   
      ratio_p = ComparePriceDirection(-2, -1);      
      if (Small_100(ratio_p)){         
         
         if (OverlapDirection(-2, 0)){
            AddDesignation(desig_L3, "()");   
         }
         
      }         
         
   }

   return(0);   
} 