

int Rule_4_a_iii(){
////////////////////////////////////////////////////////////////////////////////////////////////////////////
//Категория “iii”: дължината на m3 e повече от  261.8% от дължината на m2
////////////////////////////////////////////////////////////////////////////////////////////////////////////      
   InfoParagraph = "4-a-iii:1";
   Rule_4_a_iii_paragraph_1();
   InfoParagraph = "4-a-iii:2";
   Rule_4_a_iii_paragraph_2();
   InfoParagraph = "4-a-iii:3";
   Rule_4_a_iii_paragraph_3();
}

int Rule_4_a_iii_paragraph_1(){   
/* 
////////////////////////////////////////////////////////////////////////////////////////////////////////////
Ако дължината на m(-1) превишава 261.8% дължината на m1, 
вероятноста в m1 да завършва някаква фигура на Елиът е близка до нула; 
поставете в края на m1 само едно обозначение “:F3”.
////////////////////////////////////////////////////////////////////////////////////////////////////////////
*/    
   double ratio_p = ComparePriceDirection(-1, 1);
   if ( Large_261(ratio_p) ){
      AddDesignation(desig_F3, "");  
   }
   return(0);  
} 

int Rule_4_a_iii_paragraph_2(){   
/* 
////////////////////////////////////////////////////////////////////////////////////////////////////////////
Ако дължината на m4 е по-голяма или равна на дължината на m3, 
вероятноста в m1 да завършва някаква фигура на Елиът е много малка; поставете в края на m1 обозначение “:F3”.
////////////////////////////////////////////////////////////////////////////////////////////////////////////
*/ 
   double ratio_p = ComparePriceDirection(4, 3);
   if ( Large_100(ratio_p) ){
      AddDesignation(desig_F3, ""); 
   }
   return(0);  
} 

int Rule_4_a_iii_paragraph_3(){   
/* 
////////////////////////////////////////////////////////////////////////////////////////////////////////////
Ако m4 е по-кратка от m3, ветоятността m1 да е начало на ценова фигура на Елиът е много малка, 
поставете в края на m1 обозначение “:s5”.
////////////////////////////////////////////////////////////////////////////////////////////////////////////
*/ 
   double ratio_p = ComparePriceDirection(4, 3);
   if ( Small_100(ratio_p) ){
      AddDesignation(desig_s5, ""); 
   }
   return(0);  
}