

int Rule_4_c_i(){
////////////////////////////////////////////////////////////////////////////////////////////////////////////
//Категория “i”: дължината на m3 е не по-малка от 100%, но е по малка от 161.8% от дължината на m2
////////////////////////////////////////////////////////////////////////////////////////////////////////////      
   InfoParagraph = "4-c-i:1";
   Rule_4_c_i_paragraph_1();
}


int Rule_4_c_i_paragraph_1(){   
/* 
////////////////////////////////////////////////////////////////////////////////////////////////////////////
Особенноста на тази ситуация не позволява да се направят каквито и да било предположения, 
за това в края на m1 поставете обозначение “:F3/:c3”. 
Ако в процеса на образуване на m2 се пресича крайното ниво на m1, поставете х пред обозначение “:с3”. 
Изследване на взаимодействието на m1 с близкостоящите вълни ще ви помогне да разберете 
коя от двете предложени по горе структорни обозначения по добре описват текущите условия.
////////////////////////////////////////////////////////////////////////////////////////////////////////////
*/             
  
   AddDesignation(desig_F3, "");             
   if (BreakEndToFormationDirection(1, 2)){
      AddDesignation(desig_xc3, ""); 
   }else{
      AddDesignation(desig_c3, "");    
   }
   return(0);  
} 


