

int Rule_2_e(){
////////////////////////////////////////////////////////////////////////////////////////////////////////////
//Условие “e”: дължината на m0 е повече от 161.8% от дължината на m1 
////////////////////////////////////////////////////////////////////////////////////////////////////////////      
   InfoParagraph = "2-e:1";
   Rule_2_e_paragraph_1();
   InfoParagraph = "2-e:2";
   Rule_2_e_paragraph_2();
}


int Rule_2_e_paragraph_1(){   
/* 
////////////////////////////////////////////////////////////////////////////////////////////////////////////
При това условие най-вероятното структорно обозначение за вълна m1 е “:5”; поставете “:5” в края на m1. 
Ако вълна m3 е кратка и “хоризонатална” в сравнение с вълна m1, 
обозначението “:5” ще бъде единствената възможна алтернатива.
////////////////////////////////////////////////////////////////////////////////////////////////////////////
*/      
   AddDesignation(desig_5, "");
   return(0);  
} 

int Rule_2_e_paragraph_2(){   
/* 
////////////////////////////////////////////////////////////////////////////////////////////////////////////
Ако началното ниво на m2 (плюс една единица време) се достига от m3 за период по-малък от времето за формирането на m2, 
и m3 е по дълга и “остра” отколкото m1, и ценовите прокеции на m(-1) и m1 не се препокриват, 
то Сложна корекция с пропаднала х-вълна в средата на m0, може да завършва в края на m2; 
в този случай означете “:с3” в края на m1, поставете кръгче в средата на m0 и добавете отдясно на m1 означение “х:с3?”, 
а отляво напишете “:5”.
////////////////////////////////////////////////////////////////////////////////////////////////////////////
*/        
   double time_2_break = TimeBreakDirection(2);
   double time_2 = TimeDirection(2);
      
   if (time_2_break <= (time_2+1) && time_2_break > 0){
   
      double ratio_p = ComparePriceDirection(3, 1);
      if (Large_100(ratio_p)){       
      
         if (!OverlapDirection(-1, 1)){
            AddDesignation(desig_c3, "");   
            AddDesignation(desig_fall, "0");
         }
      }
   }   
   return(0);  
} 

